; domain
(define (domain spanner)                    
(:requirements :typing :strips :constraints)      

(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
; params: python3 spanner-generator.py 3 1 2 --seed 535281 --problem-name prob_s3_n1_l2_s535281
(define (problem prob_s3_n1_l2_s535281)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 - spanner
     nut1 - nut
     location1 location2 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location2)
    (useable spanner1)
    (at spanner2 location1)
    (useable spanner2)
    (at spanner3 location2)
    (useable spanner3)
    (loose nut1)
    (at nut1 gate)
    (link shed location1)
    (link location2 gate)
    (link location1 location2)
)
 (:goal
  (and
   (tightened nut1)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 1
2. (pickup_spanner location1 spanner2 bob)
   deleted: (at spanner2 location1)
   added: (carrying bob spanner2)
   goals met: 0 of 1
3. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 1
4. (walk location2 gate bob)
   deleted: (at bob location2)
   added: (at bob gate)
   goals met: 0 of 1
5. (tighten_nut gate spanner2 bob nut1)
   deleted: (loose nut1) (useable spanner2)
   added: (tightened nut1)
   goals met: 1 of 1
